Австралия/src/DataProcessors/ExternalUsersDesktop/ExternalUsersDesktop.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ExternalUsersDesktop</name>
</mdclass:DataProcessor>

Австралия/src/AccumulationRegisters/AccountsReceivable/AccountsReceivable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AccountsReceivable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPayment</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPaymentCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SettlementsType</name>
    <type>
      <types>EnumRef.SettlementsTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.RegistersCorrection</types>
      <types>DocumentRef.FixedAssetSale</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.AccountSalesFromConsignee</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.SubcontractorInvoiceIssued</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.OnlineReceipt</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.ArApAdjustments</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.OnlinePayment</types>
      <types>DocumentRef.AdditionalExpenses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/AccountsPayable/AccountsPayable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AccountsPayable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPayment</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPaymentCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SettlementsType</name>
    <type>
      <types>EnumRef.SettlementsTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.RegistersCorrection</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.SubcontractorInvoiceReceived</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.OnlineReceipt</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.ArApAdjustments</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.OnlinePayment</types>
      <types>DocumentRef.AdditionalExpenses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.PurchaseOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Catalogs/CounterpartyContracts/CounterpartyContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CounterpartyContracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlowItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractForm</name>
    <type>
      <types>CatalogRef.ContractForms</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractKind</name>
    <type>
      <types>EnumRef.ContractType</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractType</name>
    <type>
      <types>CatalogRef.CounterpartyContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ProvideEPD</name>
    <type>
      <types>EnumRef.VariantsOfProvidingEPD</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.CounterpartyContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierPriceTypes</name>
    <type>
      <types>CatalogRef.SupplierPriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidityEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValidityStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTermsTemplate</name>
    <type>
      <types>CatalogRef.PaymentTermsTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>CreditLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OverdueLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DirectDebitMandate</name>
    <type>
      <types>CatalogRef.DirectDebitMandates</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.ShippingAddresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovePurchaseOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LimitWithoutApproval</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VisibleToExternalUsers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EditableParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>InfobaseParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Parameter</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
        <types>EnumRef.ContractsWithCounterpartiesTemplatesParameters</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>StagesOfPayment</name>
    <attributes>
      <name>Term</name>
      <type>
        <types>EnumRef.PaymentTerm</types>
      </type>
    </attributes>
    <attributes>
      <name>BaselineDate</name>
      <type>
        <types>EnumRef.BaselineDateForPayment</types>
      </type>
    </attributes>
    <attributes>
      <name>DuePeriod</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EarlyPaymentDiscounts</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/DataProcessors/ExternalUsersDesktop/Forms/FinanceDataChartForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	User = SessionParameters.CurrentExternalUser;
	
	If ValueIsFilled(User) Then
		
		AuthorizationObject = Common.ObjectAttributeValue(User, "AuthorizationObject");
		
		If TypeOf(AuthorizationObject) = Type("CatalogRef.Counterparties") Then
			Counterparty = AuthorizationObject;
		ElsIf TypeOf(AuthorizationObject) = Type("CatalogRef.ContactPersons") Then
			Counterparty = Common.ObjectAttributeValue(AuthorizationObject, "Owner");
		EndIf;
		
	EndIf;
	
	FillStatementOfAccountChart();
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure StatementOfAccountChartSelection(Item, ChartValue, StandardProcessing)
	
	FormParameters = New Structure;
	FormParameters.Insert("VariantKey"						, "Statement");
	FormParameters.Insert("PurposeUseKey"					, "StatementByCounterparty");
	FormParameters.Insert("Filter"							, New Structure("Counterparty", Counterparty));
	FormParameters.Insert("GenerateOnOpen"					, True);
	FormParameters.Insert("ReportOptionsCommandsVisibility"	, True);
	
	OpenForm("Report.StatementOfAccount.Form",
		FormParameters,
		ThisForm,
		UUID);
		
EndProcedure

#EndRegion

#Region Private
	
&AtServer
Procedure FillStatementOfAccountChart()
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	AccountsReceivableBalancesAndTurnovers.Contract AS Contract
	|INTO TemporaryTableContracts
	|FROM
	|	AccumulationRegister.AccountsReceivable.BalanceAndTurnovers(&BeginOfPeriodFirstMonth, &EndOfPeriodLastMonth, Month, , Counterparty = &Counterparty) AS AccountsReceivableBalancesAndTurnovers
	|		LEFT JOIN Catalog.CounterpartyContracts AS CounterpartyContracts
	|		ON AccountsReceivableBalancesAndTurnovers.Contract = CounterpartyContracts.Ref
	|		LEFT JOIN Catalog.Counterparties AS Counterparties
	|		ON AccountsReceivableBalancesAndTurnovers.Counterparty = Counterparties.Ref
	|WHERE
	|	CASE
	|			WHEN &UseContractRestrictionsTurnOff
	|				THEN TRUE
	|			WHEN Counterparties.DoOperationsByContracts
	|					AND CounterpartyContracts.VisibleToExternalUsers
	|				THEN TRUE
	|			WHEN NOT Counterparties.DoOperationsByContracts
	|				THEN TRUE
	|			ELSE FALSE
	|		END
	|
	|UNION ALL
	|
	|SELECT
	|	AccountsPayableBalancesAndTurnovers.Contract
	|FROM
	|	AccumulationRegister.AccountsPayable.BalanceAndTurnovers(&BeginOfPeriodFirstMonth, &EndOfPeriodLastMonth, Month, , Counterparty = &Counterparty) AS AccountsPayableBalancesAndTurnovers
	|		LEFT JOIN Catalog.CounterpartyContracts AS CounterpartyContracts
	|		ON AccountsPayableBalancesAndTurnovers.Contract = CounterpartyContracts.Ref
	|		LEFT JOIN Catalog.Counterparties AS Counterparties
	|		ON AccountsPayableBalancesAndTurnovers.Counterparty = Counterparties.Ref
	|WHERE
	|	CASE
	|			WHEN &UseContractRestrictionsTurnOff
	|				THEN TRUE
	|			WHEN Counterparties.DoOperationsByContracts
	|					AND CounterpartyContracts.VisibleToExternalUsers
	|				THEN TRUE
	|			WHEN NOT Counterparties.DoOperationsByContracts
	|				THEN TRUE
	|			ELSE FALSE
	|		END
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TemporaryTableContracts.Contract AS Contract
	|INTO TemporaryTableContractsGroup
	|FROM
	|	TemporaryTableContracts AS TemporaryTableContracts
	|
	|GROUP BY
	|	TemporaryTableContracts.Contract
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT ALLOWED
	|	&BeginOfPeriodFirstMonth AS MonthPeriod,
	|	TemporaryTableContractsGroup.Contract AS Contract,
	|	CASE
	|		WHEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0) > 0
	|			THEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END - CASE
	|		WHEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0) < 0
	|			THEN -ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END AS TotalClosingBalance
	|INTO TemporaryTableStatement
	|FROM
	|	TemporaryTableContractsGroup AS TemporaryTableContractsGroup
	|		LEFT JOIN AccumulationRegister.AccountsReceivable.BalanceAndTurnovers(&BeginOfPeriodFirstMonth, &EndOfPeriodFirstMonth, Month, , Counterparty = &Counterparty) AS AccountsReceivableBalancesAndTurnovers
	|		ON TemporaryTableContractsGroup.Contract = AccountsReceivableBalancesAndTurnovers.Contract
	|
	|UNION ALL
	|
	|SELECT
	|	&BeginOfPeriodFirstMonth,
	|	TemporaryTableContractsGroup.Contract,
	|	CASE
	|		WHEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0) < 0
	|			THEN -ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END - CASE
	|		WHEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0) > 0
	|			THEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END
	|FROM
	|	TemporaryTableContractsGroup AS TemporaryTableContractsGroup
	|		LEFT JOIN AccumulationRegister.AccountsPayable.BalanceAndTurnovers(&BeginOfPeriodFirstMonth, &EndOfPeriodFirstMonth, Month, , Counterparty = &Counterparty) AS AccountsPayableBalancesAndTurnovers
	|		ON TemporaryTableContractsGroup.Contract = AccountsPayableBalancesAndTurnovers.Contract
	|
	|UNION ALL
	|
	|SELECT
	|	&BeginOfPeriodSecondMonth,
	|	TemporaryTableContractsGroup.Contract,
	|	CASE
	|		WHEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0) > 0
	|			THEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END - CASE
	|		WHEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0) < 0
	|			THEN -ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END
	|FROM
	|	TemporaryTableContractsGroup AS TemporaryTableContractsGroup
	|		LEFT JOIN AccumulationRegister.AccountsReceivable.BalanceAndTurnovers(&BeginOfPeriodSecondMonth, &EndOfPeriodSecondMonth, Month, , Counterparty = &Counterparty) AS AccountsReceivableBalancesAndTurnovers
	|		ON TemporaryTableContractsGroup.Contract = AccountsReceivableBalancesAndTurnovers.Contract
	|
	|UNION ALL
	|
	|SELECT
	|	&BeginOfPeriodSecondMonth,
	|	TemporaryTableContractsGroup.Contract,
	|	CASE
	|		WHEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0) < 0
	|			THEN -ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END - CASE
	|		WHEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0) > 0
	|			THEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END
	|FROM
	|	TemporaryTableContractsGroup AS TemporaryTableContractsGroup
	|		LEFT JOIN AccumulationRegister.AccountsPayable.BalanceAndTurnovers(&BeginOfPeriodSecondMonth, &EndOfPeriodSecondMonth, Month, , Counterparty = &Counterparty) AS AccountsPayableBalancesAndTurnovers
	|		ON TemporaryTableContractsGroup.Contract = AccountsPayableBalancesAndTurnovers.Contract
	|
	|UNION ALL
	|
	|SELECT
	|	&BeginOfPeriodLastMonth,
	|	TemporaryTableContractsGroup.Contract,
	|	CASE
	|		WHEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0) > 0
	|			THEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END - CASE
	|		WHEN ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0) < 0
	|			THEN -ISNULL(AccountsReceivableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END
	|FROM
	|	TemporaryTableContractsGroup AS TemporaryTableContractsGroup
	|		LEFT JOIN AccumulationRegister.AccountsReceivable.BalanceAndTurnovers(&BeginOfPeriodLastMonth, &EndOfPeriodLastMonth, Month, , Counterparty = &Counterparty) AS AccountsReceivableBalancesAndTurnovers
	|		ON TemporaryTableContractsGroup.Contract = AccountsReceivableBalancesAndTurnovers.Contract
	|
	|UNION ALL
	|
	|SELECT
	|	&BeginOfPeriodLastMonth,
	|	TemporaryTableContractsGroup.Contract,
	|	CASE
	|		WHEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0) < 0
	|			THEN -ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END - CASE
	|		WHEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0) > 0
	|			THEN ISNULL(AccountsPayableBalancesAndTurnovers.AmountClosingBalance, 0)
	|		ELSE 0
	|	END
	|FROM
	|	TemporaryTableContractsGroup AS TemporaryTableContractsGroup
	|		LEFT JOIN AccumulationRegister.AccountsPayable.BalanceAndTurnovers(&BeginOfPeriodLastMonth, &EndOfPeriodLastMonth, Month, , Counterparty = &Counterparty) AS AccountsPayableBalancesAndTurnovers
	|		ON TemporaryTableContractsGroup.Contract = AccountsPayableBalancesAndTurnovers.Contract
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TemporaryTableStatement.MonthPeriod AS MonthPeriod,
	|	TemporaryTableStatement.Contract AS Contract,
	|	SUM(TemporaryTableStatement.TotalClosingBalance) AS TotalClosingBalance
	|FROM
	|	TemporaryTableStatement AS TemporaryTableStatement
	|
	|GROUP BY
	|	TemporaryTableStatement.MonthPeriod,
	|	TemporaryTableStatement.Contract
	|
	|ORDER BY
	|	MonthPeriod,
	|	Contract
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TemporaryTableStatement.Contract AS Contract,
	|	PRESENTATION(TemporaryTableStatement.Contract) AS ContractPresentation
	|FROM
	|	TemporaryTableStatement AS TemporaryTableStatement
	|
	|GROUP BY
	|	TemporaryTableStatement.Contract";
	
	CurrentSessionDate = CurrentSessionDate();
	
	BegOfMonth = BegOfMonth(CurrentSessionDate);
	
	BeginOfPeriodFirstMonth = AddMonth(BegOfMonth, -2);
	EndOfPeriodFirstMonth = EndOfMonth(BeginOfPeriodFirstMonth);
	
	BeginOfPeriodSecondMonth = AddMonth(BegOfMonth, -1);
	EndOfPeriodSecondMonth = EndOfMonth(BeginOfPeriodSecondMonth);
	
	BeginOfPeriodLastMonth = BegOfMonth(CurrentSessionDate); 
	EndOfPeriodLastMonth = EndOfMonth(CurrentSessionDate); 
	
	Query.SetParameter("BeginOfPeriodFirstMonth"	, BeginOfPeriodFirstMonth);
	Query.SetParameter("EndOfPeriodFirstMonth"		, EndOfPeriodFirstMonth);
	Query.SetParameter("BeginOfPeriodSecondMonth"	, BeginOfPeriodSecondMonth);
	Query.SetParameter("EndOfPeriodSecondMonth"		, EndOfPeriodSecondMonth);
	Query.SetParameter("BeginOfPeriodLastMonth"		, BeginOfPeriodLastMonth);
	Query.SetParameter("EndOfPeriodLastMonth"		, EndOfPeriodLastMonth);
	Query.SetParameter("Counterparty"				, Counterparty);
	Query.SetParameter("UseContractRestrictionsTurnOff",
		Not GetFunctionalOption("UseContractRestrictionsForExternalUsers"));
	
	QueryResult = Query.ExecuteBatch();
	
	SeriesSelection = QueryResult[QueryResult.Count() - 1].Select();
	
	SeriesMap = New Map;
	
	StatementOfAccountChart.Clear();
	StatementOfAccountChart.AutoMinValue = False;
	
	StatementOfAccountChart.AutoTransposition = False;
	
	SeriesPosition = 0;
	While SeriesSelection.Next() Do
		
		NewSeries = StatementOfAccountChart.Series.Add(SeriesSelection.ContractPresentation);
		
		SeriesMap.Insert(SeriesSelection.Contract, SeriesPosition);
		
		SeriesPosition = SeriesPosition + 1;
		
	EndDo;
	
	SelectionDetailRecords = QueryResult[QueryResult.Count() - 2].Select();
	
	While SelectionDetailRecords.Next() Do

		CurrentSeries = SeriesMap.Get(SelectionDetailRecords.Contract);
		
		Point = StatementOfAccountChart.SetPoint(Format(SelectionDetailRecords.MonthPeriod, NStr("en = 'DF=''MMM yyyy'''; ru = 'ДФ=''МММ гггг''';pl = 'DF = ''MMM yyyy''';es_ES = 'DF=''MMM yyyy''';es_CO = 'DF=''MMM yyyy''';tr = 'DF=''MMM yyyy''';it = 'DF=''MMM yyyy''';de = 'DF=''MMM yyyy'''")));
				
		StatementOfAccountChart.SetValue(Point
			, CurrentSeries
			, SelectionDetailRecords.TotalClosingBalance
			, Undefined
			, Format(SelectionDetailRecords.TotalClosingBalance, "ND=15; NFD=2"));
		
	EndDo;
	
	StatementOfAccountChart.AutoTransposition = True;
	
EndProcedure

&AtClient
Procedure RefreshChart(Command)
	
	FillStatementOfAccountChart();
	
EndProcedure

#EndRegion
